a.a

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><Version xmlns="http://schemas.microsoft.com/analysisservices/2008/engine/100" Sequence="400"/></soap:Header><soap:Body><Discover xmlns="urn:schemas-microsoft-com:xml-analysis"><RequestType>DISCOVER_PROPERTIES</RequestType><Restrictions><RestrictionList><PropertyName>DbpropMsmdSubqueries</PropertyName></RestrictionList></Restrictions><Properties><PropertyList/></Properties></Discover></soap:Body></soap:Envelope>
discover: DISCOVER_PROPERTIES
<?xml version="1.0"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><SOAP-ENV:Header> </SOAP-ENV:Header><SOAP-ENV:Body><cxmla:DiscoverResponse xmlns:cxmla="urn:schemas-microsoft-com:xml-analysis"><cxmla:return><root xmlns="urn:schemas-microsoft-com:xml-analysis:rowset" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:EX="urn:schemas-microsoft-com:xml-analysis:exception"><xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="urn:schemas-microsoft-com:xml-analysis:rowset" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:sql="urn:schemas-microsoft-com:xml-sql" targetNamespace="urn:schemas-microsoft-com:xml-analysis:rowset" elementFormDefault="qualified"><xsd:element name="root"><xsd:complexType><xsd:sequence><xsd:element name="row" type="row" minOccurs="0" maxOccurs="unbounded"/></xsd:sequence></xsd:complexType></xsd:element><xsd:simpleType name="uuid"><xsd:restriction base="xsd:string"><xsd:pattern value="[0-9a-fA-F]{8}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{12}"/></xsd:restriction></xsd:simpleType><xsd:complexType name="row"><xsd:sequence><xsd:element sql:field="PropertyName" name="PropertyName" type="xsd:string"/><xsd:element sql:field="PropertyDescription" name="PropertyDescription" type="xsd:string"/><xsd:element sql:field="PropertyType" name="PropertyType" type="xsd:string"/><xsd:element sql:field="PropertyAccessType" name="PropertyAccessType" type="xsd:string"/><xsd:element sql:field="IsRequired" name="IsRequired" type="xsd:boolean"/><xsd:element sql:field="Value" name="Value" type="xsd:string"/></xsd:sequence></xsd:complexType></xsd:schema></root></cxmla:return></cxmla:DiscoverResponse></SOAP-ENV:Body></SOAP-ENV:Envelope>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><Version xmlns="http://schemas.microsoft.com/analysisservices/2008/engine/100" Sequence="400"/></soap:Header><soap:Body><Discover xmlns="urn:schemas-microsoft-com:xml-analysis"><RequestType>DISCOVER_PROPERTIES</RequestType><Restrictions><RestrictionList><PropertyName>DbpropMsmdOptimizeResponse</PropertyName></RestrictionList></Restrictions><Properties><PropertyList/></Properties></Discover></soap:Body></soap:Envelope>
discover: DISCOVER_PROPERTIES
<?xml version="1.0"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><SOAP-ENV:Header> </SOAP-ENV:Header><SOAP-ENV:Body><cxmla:DiscoverResponse xmlns:cxmla="urn:schemas-microsoft-com:xml-analysis"><cxmla:return><root xmlns="urn:schemas-microsoft-com:xml-analysis:rowset" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:EX="urn:schemas-microsoft-com:xml-analysis:exception"><xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="urn:schemas-microsoft-com:xml-analysis:rowset" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:sql="urn:schemas-microsoft-com:xml-sql" targetNamespace="urn:schemas-microsoft-com:xml-analysis:rowset" elementFormDefault="qualified"><xsd:element name="root"><xsd:complexType><xsd:sequence><xsd:element name="row" type="row" minOccurs="0" maxOccurs="unbounded"/></xsd:sequence></xsd:complexType></xsd:element><xsd:simpleType name="uuid"><xsd:restriction base="xsd:string"><xsd:pattern value="[0-9a-fA-F]{8}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{12}"/></xsd:restriction></xsd:simpleType><xsd:complexType name="row"><xsd:sequence><xsd:element sql:field="PropertyName" name="PropertyName" type="xsd:string"/><xsd:element sql:field="PropertyDescription" name="PropertyDescription" type="xsd:string"/><xsd:element sql:field="PropertyType" name="PropertyType" type="xsd:string"/><xsd:element sql:field="PropertyAccessType" name="PropertyAccessType" type="xsd:string"/><xsd:element sql:field="IsRequired" name="IsRequired" type="xsd:boolean"/><xsd:element sql:field="Value" name="Value" type="xsd:string"/></xsd:sequence></xsd:complexType></xsd:schema></root></cxmla:return></cxmla:DiscoverResponse></SOAP-ENV:Body></SOAP-ENV:Envelope>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><Version xmlns="http://schemas.microsoft.com/analysisservices/2008/engine/100" Sequence="400"/></soap:Header><soap:Body><Discover xmlns="urn:schemas-microsoft-com:xml-analysis"><RequestType>DISCOVER_PROPERTIES</RequestType><Restrictions><RestrictionList><PropertyName>DbpropMsmdActivityID</PropertyName></RestrictionList></Restrictions><Properties><PropertyList/></Properties></Discover></soap:Body></soap:Envelope>
discover: DISCOVER_PROPERTIES
<?xml version="1.0"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><SOAP-ENV:Header> </SOAP-ENV:Header><SOAP-ENV:Body><cxmla:DiscoverResponse xmlns:cxmla="urn:schemas-microsoft-com:xml-analysis"><cxmla:return><root xmlns="urn:schemas-microsoft-com:xml-analysis:rowset" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:EX="urn:schemas-microsoft-com:xml-analysis:exception"><xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="urn:schemas-microsoft-com:xml-analysis:rowset" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:sql="urn:schemas-microsoft-com:xml-sql" targetNamespace="urn:schemas-microsoft-com:xml-analysis:rowset" elementFormDefault="qualified"><xsd:element name="root"><xsd:complexType><xsd:sequence><xsd:element name="row" type="row" minOccurs="0" maxOccurs="unbounded"/></xsd:sequence></xsd:complexType></xsd:element><xsd:simpleType name="uuid"><xsd:restriction base="xsd:string"><xsd:pattern value="[0-9a-fA-F]{8}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{12}"/></xsd:restriction></xsd:simpleType><xsd:complexType name="row"><xsd:sequence><xsd:element sql:field="PropertyName" name="PropertyName" type="xsd:string"/><xsd:element sql:field="PropertyDescription" name="PropertyDescription" type="xsd:string"/><xsd:element sql:field="PropertyType" name="PropertyType" type="xsd:string"/><xsd:element sql:field="PropertyAccessType" name="PropertyAccessType" type="xsd:string"/><xsd:element sql:field="IsRequired" name="IsRequired" type="xsd:boolean"/><xsd:element sql:field="Value" name="Value" type="xsd:string"/></xsd:sequence></xsd:complexType></xsd:schema></root></cxmla:return></cxmla:DiscoverResponse></SOAP-ENV:Body></SOAP-ENV:Envelope>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><BeginGetSessionToken xmlns:msxmla="http://schemas.microsoft.com/analysisservices/2003/xmla"/><Version xmlns="http://schemas.microsoft.com/analysisservices/2008/engine/100" Sequence="400"/></soap:Header><soap:Body><Execute xmlns="urn:schemas-microsoft-com:xml-analysis"><Command><Statement xmlns="urn:schemas-microsoft-com:xml-analysis"/></Command><Properties><PropertyList><LocaleIdentifier>1049</LocaleIdentifier></PropertyList></Properties></Execute></soap:Body></soap:Envelope>
body execute
undefined { LocaleIdentifier: '1049' } undefined
execute: undefined { LocaleIdentifier: '1049' }
<?xml version="1.0"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><SOAP-ENV:Header> </SOAP-ENV:Header><SOAP-ENV:Body><cxmla:ExecuteResponse xmlns:cxmla="urn:schemas-microsoft-com:xml-analysis"><cxmla:return><root xmlns="urn:schemas-microsoft-com:xml-analysis:rowset" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:EX="urn:schemas-microsoft-com:xml-analysis:exception"><xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="urn:schemas-microsoft-com:xml-analysis:rowset" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:sql="urn:schemas-microsoft-com:xml-sql" targetNamespace="urn:schemas-microsoft-com:xml-analysis:rowset" elementFormDefault="qualified"><xsd:element name="root"><xsd:complexType><xsd:sequence><xsd:element name="row" type="row" minOccurs="0" maxOccurs="unbounded"/></xsd:sequence></xsd:complexType></xsd:element><xsd:simpleType name="uuid"><xsd:restriction base="xsd:string"><xsd:pattern value="[0-9a-fA-F]{8}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{12}"/></xsd:restriction></xsd:simpleType><xsd:complexType name="row"><xsd:sequence></xsd:sequence></xsd:complexType></xsd:schema></root></cxmla:return></cxmla:ExecuteResponse></SOAP-ENV:Body></SOAP-ENV:Envelope>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><BeginSession xmlns="urn:schemas-microsoft-com:xml-analysis"/><Version xmlns="http://schemas.microsoft.com/analysisservices/2008/engine/100" Sequence="400"/></soap:Header><soap:Body><Execute xmlns="urn:schemas-microsoft-com:xml-analysis"><Command><Statement xmlns="urn:schemas-microsoft-com:xml-analysis"/></Command><Properties><PropertyList><LocaleIdentifier>1049</LocaleIdentifier></PropertyList></Properties></Execute></soap:Body></soap:Envelope>
body execute
undefined { LocaleIdentifier: '1049' } undefined
execute: undefined { LocaleIdentifier: '1049' }
<?xml version="1.0"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><SOAP-ENV:Header> </SOAP-ENV:Header><SOAP-ENV:Body><cxmla:ExecuteResponse xmlns:cxmla="urn:schemas-microsoft-com:xml-analysis"><cxmla:return><root xmlns="urn:schemas-microsoft-com:xml-analysis:rowset" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:EX="urn:schemas-microsoft-com:xml-analysis:exception"><xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="urn:schemas-microsoft-com:xml-analysis:rowset" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:sql="urn:schemas-microsoft-com:xml-sql" targetNamespace="urn:schemas-microsoft-com:xml-analysis:rowset" elementFormDefault="qualified"><xsd:element name="root"><xsd:complexType><xsd:sequence><xsd:element name="row" type="row" minOccurs="0" maxOccurs="unbounded"/></xsd:sequence></xsd:complexType></xsd:element><xsd:simpleType name="uuid"><xsd:restriction base="xsd:string"><xsd:pattern value="[0-9a-fA-F]{8}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{12}"/></xsd:restriction></xsd:simpleType><xsd:complexType name="row"><xsd:sequence></xsd:sequence></xsd:complexType></xsd:schema></root></cxmla:return></cxmla:ExecuteResponse></SOAP-ENV:Body></SOAP-ENV:Envelope>
